HW2/rottenpotatoes/app/controllers/movies_controller.rb

  def index
    sort = params[:sort]
    order = params[:order]
    @order = (order.nil? || order == 'desc') ? 'asc' : 'desc'

    @all_ratings = Movie.all_ratings
    ratings = params[:ratings]
    @ratings = ratings.nil? ? Movie.all_ratings : ratings.keys
    @movies = Movie.order("#{sort} #{order}").where('rating IN (?)', @ratings).all
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('G','PG','PG-13','R','NC-17')) ORDER BY release_date desc